In [1]:
import pandas as pd
import numpy as np

In [3]:
datam=[1,2,3,4,5,6,7,8]

In [4]:
pd.DataFrame(datam,columns=["sayılar"])

   sayılar
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8

In [8]:
m=np.arange(1,10).reshape((3,3))

In [13]:
df=pd.DataFrame(m,columns=["var1","var2","var3"])

In [14]:
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [15]:
df.sample()  # 1 tane random örnek geldi

   var1  var2  var3
0     1     2     3

In [16]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [17]:
df.columns=['sütun1', 'sütun2', 'sütun3']

In [18]:
df

   sütun1  sütun2  sütun3
0       1       2       3
1       4       5       6
2       7       8       9

In [19]:
df.shape

(3, 3)

In [20]:
df.values  # değerleri liste şeklinde getirdi.

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

# dict ile df

In [27]:
s1=np.random.randint(10, size=5)
s2=np.random.randint(10, size=5)
s3=np.random.randint(10, size=5)

In [28]:
mdict={"var1":s1,"var2":s2,"var3":s3}

In [36]:
df1=pd.DataFrame(mdict)

In [37]:
df1.head()

   var1  var2  var3
0     0     0     6
1     3     4     6
2     7     6     5
3     6     4     9
4     4     8     1

In [32]:
df3=pd.read_csv("ornek.csv")

In [33]:
df3

     a   b     c
0   10  12   3.0
1   11  33  34.0
2   44  51   NaN
3   10  12   4.0
4   11  33  35.0
5   44  51   0.0
6   10  12   5.0
7   11  33  36.0
8   44  51  25.0
9   10  12   6.0
10  11  33  37.0
11  44  51   NaN
12  10  12   7.0
13  11  33  38.0
14  44  51   NaN

In [38]:
df1[1:3]

   var1  var2  var3
1     3     4     6
2     7     6     5

In [40]:
df1.index=["a","b","c","d","e"]  # indexe atama yaptı

In [41]:
df1

   var1  var2  var3
a     0     0     6
b     3     4     6
c     7     6     5
d     6     4     9
e     4     8     1

In [42]:
df1["a":"d"]  # indexte d dahil oldu önemli

   var1  var2  var3
a     0     0     6
b     3     4     6
c     7     6     5
d     6     4     9

In [43]:
"a b c d e ".split()

['a', 'b', 'c', 'd', 'e']

In [47]:
np.random.randn(5,4)

array([[ 0.30266545,  1.69372293, -1.70608593, -1.15911942],
       [-0.13484072,  0.39052784,  0.16690464,  0.18450186],
       [ 0.80770591,  0.07295968,  0.63878701,  0.3296463 ],
       [-0.49710402, -0.7540697 , -0.9434064 ,  0.48475165],
       [-0.11677332,  1.9017548 ,  0.23812696,  1.99665229]])

In [49]:
np.random.seed(101)
df3=pd.DataFrame(np.random.randn(5,4),index="a b c d e ".split(),columns="x y z w".split())
df3

          x         y         z         w
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [52]:
type(df3["w"])   # sütun komple geldi seri dir gelen

pandas.core.series.Series

In [53]:
type(df3[["w"]])  # sütun komple geldi dataframe dir gelen

pandas.core.frame.DataFrame

In [55]:
df3[["w","z"]]   # iki ifade alacaksan 2 parantez kullan

          w         z
a  0.503826  0.907969
b  0.605965 -0.848077
c -0.589001  0.528813
d  0.955057 -0.933237
e  0.683509  2.605967

In [56]:
df3["yeni_sütun"]=df3["w"]+df3["z"]  # yeni kolon ekledik iki sonra birleştirdik

In [57]:
df3

          x         y         z         w  yeni_sütun
a  2.706850  0.628133  0.907969  0.503826    1.411795
b  0.651118 -0.319318 -0.848077  0.605965   -0.242112
c -2.018168  0.740122  0.528813 -0.589001   -0.060187
d  0.188695 -0.758872 -0.933237  0.955057    0.021819
e  0.190794  1.978757  2.605967  0.683509    3.289476

In [61]:
df3["yepyeni"]=df3["x"]*df3["y"]
df3

          x         y         z         w  yeni_sütun   yepyeni
a  2.706850  0.628133  0.907969  0.503826    1.411795  1.700261
b  0.651118 -0.319318 -0.848077  0.605965   -0.242112 -0.207914
c -2.018168  0.740122  0.528813 -0.589001   -0.060187 -1.493691
d  0.188695 -0.758872 -0.933237  0.955057    0.021819 -0.143196
e  0.190794  1.978757  2.605967  0.683509    3.289476  0.377536

# dropping

In [62]:
df3.drop(["yeni_sütun","yepyeni"],axis=1)# sütun bazlı çalışacak inplace yapmadık kalıcı olmaz

          x         y         z         w
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [63]:
df3

          x         y         z         w  yeni_sütun   yepyeni
a  2.706850  0.628133  0.907969  0.503826    1.411795  1.700261
b  0.651118 -0.319318 -0.848077  0.605965   -0.242112 -0.207914
c -2.018168  0.740122  0.528813 -0.589001   -0.060187 -1.493691
d  0.188695 -0.758872 -0.933237  0.955057    0.021819 -0.143196
e  0.190794  1.978757  2.605967  0.683509    3.289476  0.377536

In [64]:
df3.drop(["yeni_sütun","yepyeni"],axis=1,inplace=True)# sütun bazlı çalışacak inplace yapmadık kalıcı olmaz

In [66]:
df3.drop("c",axis=0)  # c indexli satırı sildi

          x         y         z         w
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [68]:
df3

          x         y         z         w
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

# loc ve iloc

In [70]:
m = np.random.randint(1,30, size = (10,3))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df4

   var1  var2  var3
0     4    11    20
1    29     8    21
2    28     9    23
3    27    27    20
4    24    15    16
5    23     6    23
6    10    14     3
7    19    27    16
8    29    12    28
9    11    18     4

In [73]:
df4.loc[1] # tek indexe baktık ilk satır

var1    29
var2     8
var3    21
Name: 1, dtype: int32

In [74]:
df4.loc[1:4]  # 4 dahil

   var1  var2  var3
1    29     8    21
2    28     9    23
3    27    27    20
4    24    15    16

In [76]:
df4.iloc[1]  # 4 hariç

var1    29
var2     8
var3    21
Name: 1, dtype: int32

In [77]:
"a b c d e f g h i j".split()

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [81]:
df4.index="a b c d e f g h i j".split()  # index noları değişti.

In [86]:
df4.loc["a":"f"][["var2"]]  # a dan f ye var2 kolonu

   var2
a    11
b     8
c     9
d    27
e    15
f     6

In [87]:
df.iloc[1:5]["var2"]

1    4
2    6
3    4
4    8
Name: var2, dtype: int32